//1.Дані два масиви: ['a', 'b', 'c'] та [1, 2, 3]. Об'єднайте їх разом.

const arr1 = ['a', 'b', 'c'];
const arr2 = [1, 2, 3];

const arrRez = arr1.concat(arr2);
document.write("1.Дані два масиви: ['a', 'b', 'c'] та [1, 2, 3]. Об'єднайте їх разом.<br>");
document.write(arrRez);
document.write("<hr>");

//2. Дан масив ['a', 'b', 'c']. Додайте йому до кінця елементи 1, 2, 3.
document.write("2. Дан масив ['a', 'b', 'c']. Додайте йому до кінця елементи 1, 2, 3.<br>");
arr1.push(1, 2, 3);
document.write(arr1);
//  arr1.splice(3,0,1,2,3);
//  document.write(arr1);
document.write("<hr>");

//3.Дан масив [1, 2, 3]. Зробіть із нього масив [3, 2, 1].
document.write("3.Дан масив [1, 2, 3]. Зробіть із нього масив [3, 2, 1].<br>");

document.write(arr2.reverse());
document.write("<hr>");
arr2.reverse();
//4.Дан масив [1, 2, 3]. Додайте йому до кінця елементи 4, 5, 6.
document.write("4.Дан масив [1, 2, 3]. Додайте йому до кінця елементи 4, 5, 6.<br>");
arr2.push(4, 5, 6);
// or  arr2.splice(3,0,4,5,6);
document.write(arr2);
document.write("<hr>");
arr2.splice(3, 3);
//5.Дан масив [1, 2, 3]. Додайте йому на початок елементи 4, 5, 6.
document.write("5.Дан масив [1, 2, 3]. Додайте йому на початок елементи 4, 5, 6.<br>");
arr2.unshift(4, 5, 6);
document.write(arr2);
//arr2.splice(0,0,4,5,6);
document.write("<hr>");

//6.Дан масив ['js', 'css', 'jq']. Виведіть перший елемент на екран.
document.write("6.Дан масив ['js', 'css', 'jq']. Виведіть перший елемент на екран.<br>");
const arr3 = ['js', 'css', 'jq'];
document.write(arr3[0]);
document.write("<hr>");

//7.Дан масив [1, 2, 3, 4, 5]. За допомогою методу slice запишіть нові елементи [1, 2, 3].
document.write("7.Дан масив [1, 2, 3, 4, 5]. За допомогою методу slice запишіть нові елементи [1, 2, 3].<br>");
arr2.splice(0, 3);
arr2.push(4, 5);
const resArr2 = arr2.slice(0, 3);
document.write(resArr2);
document.write("<hr>");

//8.Дан масив [1, 2, 3, 4, 5]. За допомогою методу splice перетворіть масив на [1, 4, 5].
document.write("8.Дан масив [1, 2, 3, 4, 5]. За допомогою методу splice перетворіть масив на [1, 4, 5].<br>");
arr2.splice(1, 2);
document.write(arr2);
document.write("<hr>");

//9.Дан масив [1, 2, 3, 4, 5]. За допомогою методу splice перетворіть масив на [1, 2, 10, 3, 4, 5].
document.write("9.Дан масив [1, 2, 3, 4, 5]. За допомогою методу splice перетворіть масив на [1, 2, 10, 3, 4, 5].<br>");
const arr2New = [1, 2, 3, 4, 5];
arr2New.splice(2, 0, 10);
document.write(arr2New);
document.write("<hr>");

//10.Дан масив [3, 4, 1, 2, 7]. Відсортуйте його.
document.write("10.Дан масив [3, 4, 1, 2, 7]. Відсортуйте його.<br>");

const arr4 = [3, 4, 1, 2, 7];
// arr4.sort();
document.write(arr4.sort());
document.write("<hr>");

//11.Дан масив з елементами 'Привіт, ', 'світ' і '!'. Потрібно вивести на екран фразу 'Привіт, мир!'.
document.write("11.Дан масив з елементами 'Привіт, ', 'світ' і '!'. Потрібно вивести на екран фразу 'Привіт, мир!'.<br>");
const hello = ['Привіт, ', 'світ', '!'];
hello.splice(1, 1, "мир");
// or hello[1]='мир';
document.write(hello.join(" "));
document.write("<hr>");
hello[1] = 'світ';
//12.Дан масив ['Привіт, ', 'світ', '!']. Необхідно записати в нульовий елемент цього масиву слово 'Поки, ' (тобто замість слова 'Привіт, ' буде 'Поки, ').
document.write("12.Дан масив ['Привіт, ', 'світ', '!']. Необхідно записати в нульовий елемент цього масиву слово 'Поки, ' (тобто замість слова 'Привіт, ' буде 'Поки, '<br>");
hello[0] = 'Поки, ';
//or hello.splice(0,1,'Поки, ');
document.write(hello.join(" "));
document.write("<hr>");

//13.Створіть масив arr з елементами 1, 2, 3, 4, 5 двома різними способами.
document.write("13.Створіть масив arr з елементами 1, 2, 3, 4, 5 двома різними способами.<br>");

// const arr=[1, 2, 3, 4, 5];
let arr = new Array(1, 2, 3, 4, 5);
// for(let i=0;i<5;i++){
//     arr[i]=i+1;
// }
document.write(arr);
document.write("<hr>");

//14.Дан багатовимірний масив arr:

// var arr = [
//     ['блакитний', 'червоний', 'зелений'],
//     ['blue', 'red', 'green'],
// ];


// Виведіть за його допомогою слово 'блакитний' 'blue' .
document.write("14.Дан багатовимірний масив arr.Виведіть за його допомогою слово 'блакитний' 'blue' .<br>");
arr = [
    ['блакитний', 'червоний', 'зелений'],
    ['blue', 'red', 'green'],
];

document.write(arr[0][0] + "&nbsp;" + arr[1][0]);
document.write("<hr>");

//15.Створіть масив arr = ['a', 'b', 'c', 'd'] і за допомогою його виведіть на екран рядок 'a+b, c+d'
document.write("15.Створіть масив arr = ['a', 'b', 'c', 'd'] і за допомогою його виведіть на екран рядок 'a+b, c+d'<br>");
arr=['a', 'b', 'c', 'd'];
document.write(`${arr[0]}+${arr[1]}, ${arr[2]}+${arr[3]}`);
document.write("<hr>");
arr=[1,2,3,4];
//16.Запитайте у користувача кількість елементів масиву. Виходячи з даних, які ввів користувач створіть масив на ту кількість елементів, яку передав користувач. у кожному індексі масиву зберігайте чило який показуватиме номер елемента масиву.
document.write("16.Запитайте у користувача кількість елементів масиву. Виходячи з даних, які ввів користувач створіть масив на ту кількість елементів, яку передав користувач. у кожному індексі масиву зберігайте чило який показуватиме номер елемента масиву.<br>");
const lenght=parseInt(prompt("Введіть кількість елементів масиву від 1 до 10","5"));
if(lenght&& lenght>0 && lenght<=10){
    arr=new Array(lenght);
    for(let i=0;i<arr.length;i++)
    {
        arr[i]=i+1;
    }
    
    document.write(arr);
}
else{
    document.write("Ви ввели не число або більше за 10 чи меньше за 0!");
}

document.write("<hr>");

//17.Зробіть так, щоб з масиву, який ви створили вище, вивелися всі непарні числа в параграфі, а парні в спані з червоним тлом.
document.write("17.Зробіть так, щоб з масиву, який ви створили вище, вивелися всі непарні числа в параграфі, а парні в спані з червоним тлом.<br>");
for(let i=0;i<arr.length;i++){
    if( arr[i]%2===1){
        document.write(`<p style="background-color:green;display:inline-block">${arr[i]}  - це непарне число з массиву в параграфі!     </p><br>`)
    }
    else{
        document.write(`<span style="background-color:red; display:inline-block">${arr[i]} - це парне число з массиву в спані!    </span><br>`)
    }
}
document.write("<hr>");

//18.Напишіть код, який перетворює та об'єднує всі елементи масиву в одне рядкове значення. Елементи масиву будуть розділені комою.
document.write("18.Напишіть код, який перетворює та об'єднує всі елементи масиву в одне рядкове значення. Елементи масиву будуть розділені комою. var vegetables = ['Капуста', 'Ріпа', 'Редиска', 'Морковка']=> document.write(str1); 'Капуста, Ріпа, Редиска, Морковка'<br>");
const vegetables = ['Капуста', 'Ріпа', 'Редиска', 'Морковка'];
//  or let str1=vegetables.join(", ");
let str1='';
for(let i=0;i<vegetables.length;i++){
    str1+=vegetables[i]+", ";
}
;
document.write(str1.slice(0,-2));
document.write("<br><hr>");
document.write("FIN");